In [1]:
import pandas
import numpy

In [2]:
my_dict={
    'name':['Ringo','Paul','George','John','Yoko'],
    'age':[45,47,52,49,42],
    'salary':[30000,29000,31000,34000,10000],
    'gender':['M','M','M','M','F']
}

In [3]:
data=pandas.DataFrame(my_dict)

In [4]:
data.head() #Muestra primeras 5 filas

     name  age  salary gender
0   Ringo   45   30000      M
1    Paul   47   29000      M
2  George   52   31000      M
3    John   49   34000      M
4    Yoko   42   10000      F

In [6]:
datos_categoricos=data.select_dtypes(exclude=[numpy.number]) #Excluir data numerica y seleccionar el resto
print('La base contiene: {0} datos categóricos'.format(datos_categoricos.shape[1]))

La base contiene: 2 datos categóricos

In [7]:
data.dtypes #Tipo de datos de cada columna

name      object
age        int64
salary     int64
gender    object
dtype: object

In [8]:
data.describe() #Estadísticos descriptivos

             age        salary
count   5.000000      5.000000
mean   47.000000  26800.000000
std     3.807887   9576.011696
min    42.000000  10000.000000
25%    45.000000  29000.000000
50%    47.000000  30000.000000
75%    49.000000  31000.000000
max    52.000000  34000.000000